Somehow my Step 3 is showing a non-empty plan:
```
2024-10-11T19:01:29.091Z [ERROR] sdk.helper_resource: Unexpected error: test_terraform_path=/usr/local/google/home/wjchen/.terraform/bin/terraform test_working_directory=/tmp/plugintest1401489590 test_step_number=3
  error=
  | After applying this test step and performing a `terraform refresh`, the plan was not empty.
  | stdout
  | 
  | 
  | Terraform used the selected providers to generate the following execution
  | plan. Resource actions are indicated with the following symbols:
  |   + create
  | 
  | Terraform will perform the following actions:
  | 
  |   # google_bigquery_dataset_iam_member.access will be created
  |   + resource "google_bigquery_dataset_iam_member" "access" {
  |       + dataset_id = "tf_test_xry4gi9iwz"
  |       + etag       = (known after apply)
  |       + id         = (known after apply)
  |       + member     = "serviceAccount:tf-test-l1wbzhry1w@wjchen-osconfig-test.iam.gserviceaccount.com"
  |       + project    = (known after apply)
  |       + role       = "roles/viewer"
  |     }
  | 
  | Plan: 1 to add, 0 to change, 0 to destroy.
```

I haven't looked closely but have added my test code to this PR for you to take a look.